Dlubal.RFEM5.NonlinearityDirectionType
Direction of Non-linearity

Dlubal.RFEM5.NonlinearityDirectionType.UnknownDirectionType
Unknown direction type

Dlubal.RFEM5.NonlinearityDirectionType.AlongAxisX
Non-linearity along X-axis

Dlubal.RFEM5.NonlinearityDirectionType.AlongAxisY
Non-linearity along Y-axis

Dlubal.RFEM5.NonlinearityDirectionType.AlongAxisZ
Non-linearity along Z-axis

Dlubal.RFEM5.NonlinearityDirectionType.AroundAxisX
Non-linearity about X-axis

Dlubal.RFEM5.NonlinearityDirectionType.AroundAxisY
Non-linearity about Y-axis

Dlubal.RFEM5.NonlinearityDirectionType.AroundAxisZ
Non-linearity about Z-axis